Jack-Herron/STM32_Skipper_Development/HMI/Src/main.c
// Jack Herron
#define LV_LVGL_H_INCLUDE_SIMPLE


#include "stm32f4xx.h"
#include <stdint.h>

#include "cmsis_os.h"
#include "Clock.h"
#include "FMC_SDRAM.h"
#include "QSPI.h"
#include "DSI_LCD.h"
#include "lvgl.h"
#include "stdio.h"
#include "ui.h"
#include "I2C.h"
#include "TS.h"
#include "App.h"
#include "RTC.h"
#include "USART.h"
#include "CAN.h"

uint32_t SystemCoreClock = HCLK_FREQ;

#define COMPILE_HOUR   ((__TIME__[0] - '0') * 10 + (__TIME__[1] - '0'))
#define COMPILE_MINUTE ((__TIME__[3] - '0') * 10 + (__TIME__[4] - '0'))
#define COMPILE_SECOND ((__TIME__[6] - '0') * 10 + (__TIME__[7] - '0'))

void CAN_Data_Receive_Callback(CAN___Receive_TypeDef CAN_Packet)
{
	App___IO_RX_Data_Typedef packet;
	packet.ID = CAN_Packet.ID;
	for(uint8_t i = 0; i < CAN_Packet.data_Length; i++)
	{
		packet.data[i] = CAN_Packet.data[i];
	}
	packet.data_Length = CAN_Packet.data_Length;

	App___IO_Data_Received(&packet);
}

void DSI_Buffer_Swap_Callback(void)
{
	App___GUI_GFX_Buffer_Swap_Ready();
}

void TS_Event_Callback(void)
{
	App___GUI_TS_Event_Detected();
}

void frame_Ready_Callback(uint8_t* buf)
{
	DSI_LCD___Set_Pending_Buffer(buf);
}

static uint32_t tick_Callback(void)
{
    return(clock___millis());
}

uint8_t TS_Get_Point_Callback(uint16_t* x, uint16_t* y)
{
	uint8_t num_Points = TS___Get_Num_Points_Pressed();
	if(num_Points > 0)
	{
		TS___Get_Point(x, y);
	}

	return(num_Points);
}

void CAN_Transmit_Callback(App___IO_TX_Data_Typedef packet)
{
	CAN___Transmit_TypeDef CAN_Packet = {0};

	CAN_Packet.ID = packet.ID;
	CAN_Packet.data_Length = packet.data_Length;
	for(uint8_t i = 0; i < packet.data_Length; i++)
	{
		CAN_Packet.data[i]= packet.data[i];
	}

	CAN___Transmit(CAN_Packet);
}

App___Time_TypeDef get_Time_CallBack(void)
{
	RTC___Time_TypeDef time = RTC___Get_Time();
	App___Time_TypeDef ret;

	ret.hour = time.hour % 12;

	if (ret.hour == 0)
	{
	    ret.hour = 12;
	}

	ret.minute = time.minute;
	ret.second = time.second;
	ret.pm = (time.hour >= 12);

	return ret;
}

App___Date_TypeDef get_Date_CallBack(void)
{
	RTC___Date_TypeDef date = RTC___Get_Date();
	App___Date_TypeDef ret;
	ret.year = date.year;
	ret.month = date.month;
	ret.day = date.day;

	return(ret);
}

void set_Time_And_Date_Callback(App___Time_TypeDef time, App___Date_TypeDef date)
{
	RTC___Time_TypeDef RTC_Time;

	if (time.pm)
	{
	    RTC_Time.hour = (time.hour % 12) + 12;
	}
	else
	{
	    RTC_Time.hour = (time.hour % 12);
	}

	RTC_Time.minute = time.minute;
	RTC_Time.second = time.second;

	RTC___Date_TypeDef RTC_Date;
	RTC_Date.day = date.day;
	RTC_Date.month = date.month;
	RTC_Date.year = date.year;

	RTC___Set_Time_And_Date(RTC_Time, RTC_Date);
}

void set_Backlight_Brightness_Callback(uint16_t brightness)
{
	TIM4->CCR2 = brightness;                             // duty 0-1000
}

// Tclk = 90Mhz
void TIM4CH2_Init(void)
{
    RCC->APB1ENR |= RCC_APB1ENR_TIM4EN;
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIODEN;

    GPIOD->MODER &= ~GPIO_MODER_MODER13_Msk;
    GPIOD->MODER |= GPIO_MODER_MODER13_1;              // Alternate function mode

    GPIOD->OTYPER &= ~GPIO_OTYPER_OT13;                // Push-pull
    GPIOD->OSPEEDR |= GPIO_OSPEEDR_OSPEED13_Msk;     // High speed
    GPIOD->PUPDR &= ~GPIO_PUPDR_PUPD13_Msk;            // No pull-up/down

    GPIOD->AFR[1] &= ~GPIO_AFRH_AFSEL13_Msk;
    GPIOD->AFR[1] |= (2U << GPIO_AFRH_AFSEL13_Pos);    // AF2 = TIM4_CH2

    TIM4->PSC = 9 - 1;
    TIM4->ARR = 1000 - 1;
    TIM4->CCR2 = 250;                                 // duty 0-1000

    TIM4->CR1 |= TIM_CR1_ARPE;
    TIM4->CCMR1 &= ~(TIM_CCMR1_CC2S_Msk | TIM_CCMR1_OC2M_Msk);
    TIM4->CCMR1 |= (6U << TIM_CCMR1_OC2M_Pos);         // PWM mode 1
    TIM4->CCMR1 |= TIM_CCMR1_OC2PE;                    // CCR preload enable
    TIM4->CCER &= ~TIM_CCER_CC2P;
    TIM4->CCER |= TIM_CCER_CC2E;
    TIM4->EGR |= TIM_EGR_UG;
    TIM4->CR1 |= TIM_CR1_CEN;
}

int main(void)
{
	/* ------ HW Initialization + Setup ------ */
	clock_Init();
	millis_Init();
	RTC___Init();
	FMC_SDRAM___SDRAM_Init();
	DSI_LCD___Init();
	TIM4CH2_Init();
	USART___Init(4);
	CAN___Init();
	CAN___Accept_All_Messages();
	CAN___Set_RX_Callback(CAN_Data_Receive_Callback);
	DSI_LCD___Set_Swap_Callback(DSI_Buffer_Swap_Callback);
	TS___Init();
	TS___Set_Event_Callback(TS_Event_Callback);
	QSPI___Init();
	QSPI___Erase_Sector(0x0000);

	uint8_t data[256];
	for (uint16_t i = 0; i < 256; i++)
	{
	    data[i] = 0x55;
	}
	data[0] = 0xFF;

	QSPI___Program_Page(0x0000, data, 256);

	QSPI___Enable_MemoryMapped_Mode();

#define QSPI_BASE 0x90000000

	uint8_t test[256];
	for(uint16_t i = 0; i < 256; i++)
	{
		test[i] = *(volatile uint8_t *)(QSPI_BASE + i);
	}
	//QSPI___Read_Bytes(0x0100, test, 256);
	/* ------ Application Setup ------ */
	App___GUI_Set_Buffers((void*)0xc0000000, (void*)(0xc0000000 + 768000), 768000);
	App___GUI_Set_Dimentions(480, 800);
	App___Set_GUI_GFX_Frame_Ready_CallBack(frame_Ready_Callback);
	App___Set_Get_Tick_Callback(tick_Callback);
	App___Set_GUI_TS_Get_Point_CallBack(TS_Get_Point_Callback);
	App___Set_Get_Time_CallBack(get_Time_CallBack);
	App___Set_Get_Date_CallBack(get_Date_CallBack);
	App___Set_Change_Backlight_Brightness_Callback(set_Backlight_Brightness_Callback);
	App___Set_Time_And_Date_Callback(set_Time_And_Date_Callback);
	App___Set_Transmit_Callback(CAN_Transmit_Callback);

	/* ------ Application Initialization ------ */
	App___Init();
	printf("Starting... \n");

	osKernelStart();

	for(;;);
}

